preformance/artillery/artilleryScript.yml
config: 
  target: 'http://localhost:3002'
  phases: 
    - duration: 60
      arrivalRate: 20
    # - duration: 60
    #   arrivalRate: 100
  processor: './artilleryFunctions.js'

scenarios:
  - name: 'get id'
    flow:
      - loop: 
        - function: 'randomAttractionID'  
        - get:
            url: '/{{ id }}'
        count: 10
      - log: 'Sent a request to / {{ id }}'