preformance/artillery/artilleryScript.yml
config: 
  target: 'http://localhost:3002'
  phases: 
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 20
  processor: './artilleryFunctions.js'

scenarios:
  - name: 'get id'
    flow:
      - function: 'randomAttractionID'  
      - get:
          url: '/{{ id }}'
      - log: 'Sent a request to / {{ id }}'